__author__ = 'Alex Bulavin'
NOT_INT_POSITIVE = "Введено отрицательное число или ноль, повторите ввод"
NOT_INT = "Введено не целое число, повторите ввод"
STR_INPUT = "Введите слово на русском или английском языке без пробелов " \
            "только буквы: "
WRONG_INPUT = "Вы вместо трехзначного числа ввели строку (((. Исправьтесь"
LATIN_MAP = {
    "A": 1,
    "E": 1,
    "I": 1,
    "O": 1,
    "U": 1,
    "L": 1,
    "N": 1,
    "S": 1,
    "T": 1,
    "R": 1,
    "D": 2,
    "G": 2,
    "B": 3,
    "C": 3,
    "M": 3,
    "P": 3,
    "F": 4,
    "H": 4,
    "V": 4,
    "W": 4,
    "Y": 4,
    "K": 5,
    "J": 8,
    "X": 8,
    "Q": 10,
    "Z": 10,
}

CYR_MAP = {
    "А": 1,
    "В": 1,
    "Е": 1,
    "И": 1,
    "Н": 1,
    "О": 1,
    "Р": 1,
    "С": 1,
    "Т": 1,
    "Д": 2,
    "К": 2,
    "Л": 2,
    "М": 2,
    "П": 2,
    "У": 2,
    "Б": 3,
    "Г": 3,
    "Ё": 3,
    "Ь": 3,
    "Я": 3,
    "Й": 4,
    "Ы": 4,
    "Ж": 5,
    "З": 5,
    "Х": 5,
    "Ц": 5,
    "Ч": 5,
    "Ш": 8,
    "Э": 8,
    "Ю": 8,
    "Ф": 10,
    "Щ": 10,
    "Ъ": 10,
}

SEASONS_LIST = ["Зима", "Весна", "Лето", "Осень"]
SEASONS_DICT = {
    1: "Зима",
    2: "Зима",
    12: "Зима",
    3: "Весна",
    4: "Весна",
    5: "Весна",
    6: "Лето",
    7: "Лето",
    8: "Лето",
    9: "Осень",
    10: "Осень",
    11: "Осень",
}

USER_FIRST_NAME_REQUEST = "Введите имя пользователя: "
USER_LAST_NAME_REQUEST = "Введите фамилию пользователя: "
USER_BIRTH_YEAR_REQUEST = "Введите год рождения пользователя: "
USER_LIVING_CITY = "Введите город проживания пользователя: "
USER_EMAIL = "Введите e-mail пользователя: "
USER_PHONE1 = "Введите телефонный номер пользователя: "
